doc/handout.tex
% Created 2022-02-05 Sat 02:22
% Intended LaTeX compiler: pdflatex
\documentclass[compress,dvipdfmx,11pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{Ohsaki}
\author{suzuki taisei}
\date{\today}
\title{dummy}
\title[2022 年度 2 月 Debian 勉強会]{\bf Debian で始める Python Programming}
\author[]{taiseiyo}
\institute{Mail Address: taiseiyo11@gmail.com}
\usepackage{amsmath}
\setlength{\parskip}{1.5ex}
\renewcommand{\textbf}{\alert}
\date{2022 年 2 月 19 日}
\hypersetup{
 pdfauthor={suzuki taisei},
 pdftitle={dummy},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.5.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\newcommand{\pivec}{\mathbf \pi}
\newcommand{\xvec}{\mathbf x}
\newcommand{\yvec}{\mathbf y}
\newcommand{\zvec}{\mathbf z}
\newcommand{\Emat}{\mathbf E}
\newcommand{\Imat}{\mathbf I}

\section{概要}
\label{sec:orgdcbd10e}
\begin{frame}[label={sec:org74ffd46}]{Python とは？}
Python(パイソン)はオブジェクト指向のプログラミング言語であり、手軽に始
める事ができ実用的な本格的なプログラムの開発を行う事が可能


言語ランキング(TIOBE Software 調べ)：1位
\url{https://www.tiobe.com/tiobe-index/}


最新の安定バージョン：3.10.2


本日のソース一式
→ git clone \url{https://github.com/taiseiyo/pman/tree/debian}
\end{frame}

\section{Python 環境作成}
\label{sec:org9684f83}
\begin{frame}[label={sec:orgcdf5714},fragile]{Python 導入：apt install を使う(Debian)}
 メリット
\begin{itemize}
\item インストールが簡単
\end{itemize}
\begin{verbatim}
sudo apt install python3 python3-pip
\end{verbatim}

デメリット
\begin{itemize}
\item バージョンが古い
\begin{itemize}
\item バージョン 3.10 以降は文法チェッカーが優秀(\url{https://www.python.org/dev/peps/pep-0626/})
\item buster(debian 10.x 系) → python 3.7
\item bullseye(debian 11.x 系) → python 3.9
\end{itemize}
\end{itemize}


\vspace{-2truemm}      
\begin{verbatim}
cat /etc/os-release or cat /etc/debian_version
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgff13449},fragile]{Python 導入：source からビルド}
 メリット
\begin{itemize}
\item 最新バージョンが手に入る
\end{itemize}
デメリット
\begin{itemize}
\item 手間がかかる(シェルでまとめておくと便利)
\end{itemize}
\begin{verbatim}
wget https://www.python.org/ftp/python/3.10.2/Python-3.10.2.tar.xz
tar Jxfv Python-3.10.2.tar.xz
cd Python-3.10.2
./configure
sudo make # ディレクトリの python が使用可能になる
# PATH が通っている所の Python を置き変える場合
sudo make altinstall
\end{verbatim}
\end{frame}



\section{pman command}
\label{sec:orgca64a49}
\begin{frame}[label={sec:org7af76c9}]{pman コマンド}
発想
\begin{itemize}
\item Debian なら man コマンドがあるが、同じ事を Python でも行いたい
\item いつでもモジュールのマニュアルが欲しい
\end{itemize}

手法
\begin{enumerate}
\item Python 公式サイトから標準ライブラリのデータ(HTML)を取得
\item HTML から文字列を取得
\end{enumerate}
\end{frame}


\section{実践(ハンズオン)}
\label{sec:org7bab952}
\begin{frame}[label={sec:org00eee34},fragile]{実践：必要なモジュール}
 \begin{itemize}
\item beautifulsoup4
\begin{itemize}
\item HTML ファイルや XML ファイルからデータを抽出するための Python ライブラリ
\end{itemize}
\item lxml
\begin{itemize}
\item \url{https://pypi.org/project/lxml/}
\item Python で xml や html を扱うためのライブラリ。Web サイトの html を
解析して情報を抽出するプログラムを作成する場合などに多く用いる
\end{itemize}
\end{itemize}

pman 作成の環境構築(\(/pman/prog/\) の想定)
\begin{verbatim}
python -m venv test
cd test
source bin/activate
pip install -r ../requirements.txt
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:orgf685346}]{実践：プログラム作成}
HTML 取得
\begin{itemize}
\item urllib.request.urlopen()
\end{itemize}


HTML 解析
\begin{itemize}
\item BeautifulSoup()
\end{itemize}
\end{frame}

\section{最後に}
\label{sec:orged916b6}
\begin{frame}[label={sec:org34fb2c0}]{最後に}
GitHub: 
\end{frame}
\end{document}